Return-Path: <netdev-owner@vger.kernel.org>
X-Original-To: lists+netdev@lfdr.de
Delivered-To: lists+netdev@lfdr.de
Received: from out1.vger.email (out1.vger.email [IPv6:2620:137:e000::1:20])
	by mail.lfdr.de (Postfix) with ESMTP id 9301F5FFF73
	for <lists+netdev@lfdr.de>; Sun, 16 Oct 2022 15:07:25 +0200 (CEST)
Received: (majordomo@vger.kernel.org) by vger.kernel.org via listexpand
        id S229577AbiJPNHT (ORCPT <rfc822;lists+netdev@lfdr.de>);
        Sun, 16 Oct 2022 09:07:19 -0400
Received: from lindbergh.monkeyblade.net ([23.128.96.19]:48698 "EHLO
        lindbergh.monkeyblade.net" rhost-flags-OK-OK-OK-OK) by vger.kernel.org
        with ESMTP id S229562AbiJPNHS (ORCPT
        <rfc822;netdev@vger.kernel.org>); Sun, 16 Oct 2022 09:07:18 -0400
Received: from mail-wr1-x42a.google.com (mail-wr1-x42a.google.com [IPv6:2a00:1450:4864:20::42a])
        by lindbergh.monkeyblade.net (Postfix) with ESMTPS id 797DA3BC57;
        Sun, 16 Oct 2022 06:07:14 -0700 (PDT)
Received: by mail-wr1-x42a.google.com with SMTP id j16so14473650wrh.5;
        Sun, 16 Oct 2022 06:07:14 -0700 (PDT)
DKIM-Signature: v=1; a=rsa-sha256; c=relaxed/relaxed;
        d=gmail.com; s=20210112;
        h=in-reply-to:content-disposition:mime-version:references:message-id
         :subject:cc:to:date:from:from:to:cc:subject:date:message-id:reply-to;
        bh=v+nli8T99hB2bZu8CRoP8Fz+qK7OvgBb4s2skVIaPIU=;
        b=FfFSdgn9GbUD1YgD/E1U0ltXh0lDSHsg5Rb/l1ihg25Jd7M5NUowzeGgKE6TD0+yqy

        NMZbjQbvzpFTzmeU0IAYkx8=
X-Google-Smtp-Source: AMsMyM6YNkqHuVztNTMpEA1xJeLlqsuFDInGqm8scqUAyTbLp4HiP/rHM/BKWrzHb3GJ/HM48lA7bA==
X-Received: by 2002:a5d:524c:0:b0:22e:39c9:3567 with SMTP id k12-20020a5d524c000000b0022e39c93567mr3474896wrc.463.1665925631808;
        Sun, 16 Oct 2022 06:07:11 -0700 (PDT)
Received: from krava ([83.240.63.167])
        by smtp.gmail.com with ESMTPSA id g17-20020a05600c4ed100b003b4ac05a8a4sm16469383wmq.27.2022.10.16.06.07.09
        (version=TLS1_3 cipher=TLS_AES_256_GCM_SHA384 bits=256/256);
        Sun, 16 Oct 2022 06:07:10 -0700 (PDT)
From:   Jiri Olsa <olsajiri@gmail.com>
X-Google-Original-From: Jiri Olsa <jolsa@kernel.org>
Date:   Sun, 16 Oct 2022 15:07:08 +0200
To:     Alan Maguire <alan.maguire@oracle.com>
Cc:     Jiri Olsa <olsajiri@gmail.com>,
        Andrii Nakryiko <andrii.nakryiko@gmail.com>,
        Jakub Kicinski <kuba@kernel.org>,
        Martin KaFai Lau <martin.lau@kernel.org>,
        bpf@vger.kernel.org,
        "netdev@vger.kernel.org" <netdev@vger.kernel.org>
Subject: Re: WARN: multiple IDs found for 'nf_conn': 92168, 117897 - using
 92168
Message-ID: <Y0wB/KzbKt2ZcuCL@krava>
References: <20221004072522.319cd826@kernel.org>
 <Yz1SSlzZQhVtl1oS@krava>
 <20221005084442.48cb27f1@kernel.org>
 <20221005091801.38cc8732@kernel.org>
 <Yz3kHX4hh8soRjGE@krava>
 <20221013080517.621b8d83@kernel.org>
 <Y0iNVwxTJmrddRuv@krava>
 <CAEf4Bzbow+8-f4rg2LRRRUD+=1wbv1MjpAh-P4=smUPtrzfZ3Q@mail.gmail.com>
 <Y0kF/radV0cg4JYk@krava>
 <d2007ba9-3c95-858d-7a73-df83de63fe5c@oracle.com>
MIME-Version: 1.0
Content-Type: text/plain; charset=us-ascii
Content-Disposition: inline
In-Reply-To: <d2007ba9-3c95-858d-7a73-df83de63fe5c@oracle.com>
X-Spam-Status: No, score=-2.1 required=5.0 tests=BAYES_00,DKIM_SIGNED,
        DKIM_VALID,DKIM_VALID_AU,DKIM_VALID_EF,FREEMAIL_FROM,
        RCVD_IN_DNSWL_NONE,SPF_HELO_NONE,SPF_PASS,UPPERCASE_50_75 autolearn=no
        autolearn_force=no version=3.4.6
X-Spam-Checker-Version: SpamAssassin 3.4.6 (2021-04-09) on
        lindbergh.monkeyblade.net
Precedence: bulk
List-ID: <netdev.vger.kernel.org>
X-Mailing-List: netdev@vger.kernel.org

On Fri, Oct 14, 2022 at 06:17:03PM +0100, Alan Maguire wrote:
> On 14/10/2022 07:47, Jiri Olsa wrote:
> > On Thu, Oct 13, 2022 at 03:24:59PM -0700, Andrii Nakryiko wrote:
> >> On Thu, Oct 13, 2022 at 3:12 PM Jiri Olsa <olsajiri@gmail.com> wrote:
> >>>
> >>> On Thu, Oct 13, 2022 at 08:05:17AM -0700, Jakub Kicinski wrote:
> >>>> On Wed, 5 Oct 2022 22:07:57 +0200 Jiri Olsa wrote:
> >>>>>> Yeah, it's there on linux-next, too.
> >>>>>>
> >>>>>> Let me grab a fresh VM and try there. Maybe it's my system. Somehow.
> >>>>>
> >>>>> ok, I will look around what's the way to install that centos 8 thing
> >>>>
> >>>> Any luck?
> >>>
> >>> now BTFIDS warnings..
> >>>
> >>> I can see following on centos8 with gcc 8.5:
> >>>
> >>>           BTFIDS  vmlinux
> >>>         WARN: multiple IDs found for 'task_struct': 300, 56614 - using 300
> >>>         WARN: multiple IDs found for 'file': 540, 56649 - using 540
> >>>         WARN: multiple IDs found for 'vm_area_struct': 549, 56652 - using 549
> >>>         WARN: multiple IDs found for 'seq_file': 953, 56690 - using 953
> >>>         WARN: multiple IDs found for 'inode': 1132, 56966 - using 1132
> >>>         WARN: multiple IDs found for 'path': 1164, 56995 - using 1164
> >>>         WARN: multiple IDs found for 'task_struct': 300, 61905 - using 300
> >>>         WARN: multiple IDs found for 'file': 540, 61943 - using 540
> >>>         WARN: multiple IDs found for 'vm_area_struct': 549, 61946 - using 549
> >>>         WARN: multiple IDs found for 'inode': 1132, 62029 - using 1132
> >>>         WARN: multiple IDs found for 'path': 1164, 62058 - using 1164
> >>>         WARN: multiple IDs found for 'cgroup': 1190, 62067 - using 1190
> >>>         WARN: multiple IDs found for 'seq_file': 953, 62253 - using 953
> >>>         WARN: multiple IDs found for 'sock': 7960, 62374 - using 7960
> >>>         WARN: multiple IDs found for 'sk_buff': 1876, 62485 - using 1876
> >>>         WARN: multiple IDs found for 'bpf_prog': 6094, 62542 - using 6094
> >>>         WARN: multiple IDs found for 'socket': 7993, 62545 - using 7993
> >>>         WARN: multiple IDs found for 'xdp_buff': 6191, 62836 - using 6191
> >>>         WARN: multiple IDs found for 'sock_common': 8164, 63152 - using 8164
> >>>         WARN: multiple IDs found for 'request_sock': 17296, 63204 - using 17296
> >>>         WARN: multiple IDs found for 'inet_request_sock': 36292, 63222 - using 36292
> >>>         WARN: multiple IDs found for 'inet_sock': 32700, 63225 - using 32700
> >>>         WARN: multiple IDs found for 'inet_connection_sock': 33944, 63240 - using 33944
> >>>         WARN: multiple IDs found for 'tcp_request_sock': 36299, 63260 - using 36299
> >>>         WARN: multiple IDs found for 'tcp_sock': 33969, 63264 - using 33969
> >>>         WARN: multiple IDs found for 'bpf_map': 6623, 63343 - using 6623
> >>>
> >>> I'll need to check on that..
> >>>
> >>> and I just actually saw the 'nf_conn' warning on linux-next/master with
> >>> latest fedora/gcc-12:
> >>>
> >>>           BTF [M] net/netfilter/nf_nat.ko
> >>>         WARN: multiple IDs found for 'nf_conn': 106518, 120156 - using 106518
> >>>         WARN: multiple IDs found for 'nf_conn': 106518, 121853 - using 106518
> >>>         WARN: multiple IDs found for 'nf_conn': 106518, 123126 - using 106518
> >>>         WARN: multiple IDs found for 'nf_conn': 106518, 124537 - using 106518
> >>>         WARN: multiple IDs found for 'nf_conn': 106518, 126442 - using 106518
> >>>         WARN: multiple IDs found for 'nf_conn': 106518, 128256 - using 106518
> >>>           LD [M]  net/netfilter/nf_nat_tftp.ko
> >>>
> >>> looks like maybe dedup missed this struct for some reason
> >>>
> >>> nf_conn dump from module:
> >>>
> >>>         [120155] PTR '(anon)' type_id=120156
> >>>         [120156] STRUCT 'nf_conn' size=320 vlen=14
> >>>                 'ct_general' type_id=105882 bits_offset=0
> >>>                 'lock' type_id=180 bits_offset=64
> >>>                 'timeout' type_id=113 bits_offset=640
> >>>                 'zone' type_id=106520 bits_offset=672
> >>>                 'tuplehash' type_id=106533 bits_offset=704
> >>>                 'status' type_id=1 bits_offset=1600
> >>>                 'ct_net' type_id=3215 bits_offset=1664
> >>>                 'nat_bysource' type_id=139 bits_offset=1728
> >>>                 '__nfct_init_offset' type_id=949 bits_offset=1856
> >>>                 'master' type_id=120155 bits_offset=1856
> >>>                 'mark' type_id=106351 bits_offset=1920
> >>>                 'secmark' type_id=106351 bits_offset=1952
> >>>                 'ext' type_id=106536 bits_offset=1984
> >>>                 'proto' type_id=106532 bits_offset=2048
> >>>
> >>> nf_conn dump from vmlinux:
> >>>
> >>>         [106517] PTR '(anon)' type_id=106518
> >>>         [106518] STRUCT 'nf_conn' size=320 vlen=14
> >>>                 'ct_general' type_id=105882 bits_offset=0
> >>>                 'lock' type_id=180 bits_offset=64
> >>>                 'timeout' type_id=113 bits_offset=640
> >>>                 'zone' type_id=106520 bits_offset=672
> >>>                 'tuplehash' type_id=106533 bits_offset=704
> >>>                 'status' type_id=1 bits_offset=1600
> >>>                 'ct_net' type_id=3215 bits_offset=1664
> >>>                 'nat_bysource' type_id=139 bits_offset=1728
> >>>                 '__nfct_init_offset' type_id=949 bits_offset=1856
> >>>                 'master' type_id=106517 bits_offset=1856
> >>>                 'mark' type_id=106351 bits_offset=1920
> >>>                 'secmark' type_id=106351 bits_offset=1952
> >>>                 'ext' type_id=106536 bits_offset=1984
> >>>                 'proto' type_id=106532 bits_offset=2048
> >>>
> >>> look identical.. Andrii, any idea?
> >>
> >> I'm pretty sure they are not identical. There is somewhere a STRUCT vs
> >> FWD difference. We had a similar discussion recently with Alan
> >> Maguire.
> >>
> >>>                 'master' type_id=120155 bits_offset=1856
> >>
> >> vs
> >>
> >>>                 'master' type_id=106517 bits_offset=1856
> > 
> > master is pointer to same 'nf_conn' object, and rest of the ids are same
> > 
> > jirka
> > 
> 
> I tried digging into this problem a bit - in my case I was seeing 
> "struct sk_buff" duplicated in kernel/module BTF. Here's what I found..
> 
> Consider a situation like this, where one header file defining a struct s1
> has a pointer field, pointing at struct s2. But struct s2 is a fwd definition.
> 
> $ cat s1.h
> #include <stdio.h>
> struct s2;
> 
> struct s1 {
>         struct s1 *f1;
>         struct s2 *f2;
> };
> 
> $ cat s1.c
> #include "s1.h"
> 
> int main(int argc, char *argv[])
> {
>         struct s1 s1;
> 
>         return 0;
> }
> 
> Now consider a separate program s2, that #includes definitions for both
> s1 and s2:
> 
> $ cat s2.h
> #include <stdio.h>
> 
> struct s1;
> 
> struct s2 {
>         struct s1 *f1;
> };
> 
> $cat s2.c
> 
> #include "s2.h"
> #include "s1.h"
> 
> int main(int argc, char *argv[])
> {
> 	struct s1 s1 = {};
> 	struct s2 s2 = {};
> 
> 	return 0;
> 
> }
> 
> In this case the generated base BTF contains a definition for s1,
> and a FWD for s2, but the "module" BTF for s2 contains a full
> definition for s2, so the dedup fails:
>  
> $ bpftool btf dump file s1
> [29] STRUCT 's1' size=16 vlen=2
> 	'f1' type_id=30 bits_offset=0
> 	'f2' type_id=32 bits_offset=64
> [30] PTR '(anon)' type_id=29
> [31] FWD 's2' fwd_kind=struct
> 
> $ bpftool btf dump -B s1 file s2
> [36] STRUCT 's2' size=8 vlen=1
> 	'f1' type_id=38 bits_offset=0
> [37] STRUCT 's1' size=16 vlen=2
> 	'f1' type_id=38 bits_offset=0
> 	'f2' type_id=39 bits_offset=64
> [38] PTR '(anon)' type_id=37
> [39] PTR '(anon)' type_id=36
> 
> 
> So we had to redefine struct s1 in the "module" because the
> FWD wasn't resolved in the base BTF. This is by design as I
> understand it; in effect we can't supplement base BTF with 
> info we've gotten from module BTF about forward resolution
> (at least that's my understanding of the reason).
> 
> Now does this sort of thing happen in the kernel? It looks like 
> it; consider struct nf_conn; it contains a possible_net_t:
> 
> typedef struct {
> 	struct net *               net;                  /*     0     8 */
> 
> 	/* size: 8, cachelines: 1, members: 1 */
> 	/* last cacheline: 8 bytes */
> } possible_net_t;
> 
> ...and a struct net * contains pointers to structures
> that aren't in the vmlinux BTF (because they are
> in modules); for example:
> 
> 	struct netns_ipvs *        ipvs;                 /*  3912     8 */
> 
> $ pahole netns_ipvs
> pahole: type 'netns_ipvs' not found
> 
> ...and in vmlinux BTF it is:
> 
> [2983] FWD 'netns_ipvs' fwd_kind=struct
> [2984] PTR '(anon)' type_id=2983
> 
> ...and in struct net we can see the fwd type is referenced alright:
> 
> [2021] STRUCT 'net' size=4288 vlen=52
> ...
>         'ipvs' type_id=2984 bits_offset=31808
> 
> So we'd expect any ipvs-related modules to not dedup
> struct net, since they'll have the full definition
> for netns_ipvs. In xt_ipvs.ko we see:
> 
> [111924] STRUCT 'netns_ipvs' size=2176 vlen=78
>         'gen' type_id=21 bits_offset=0
>         'enable' type_id=21 bits_offset=32
>         'rs_table' type_id=4044 bits_offset=64
>         'app_list' type_id=83 bits_offset=1088
> 
> ...and when we look at 'struct net' we see:
> 
> [111786] STRUCT 'net' size=4288 vlen=52
> ...
>      'ipvs' type_id=111925 bits_offset=31808
> 
> And then if we don't dedup struct net, it seems likely
> that structures referencing struct net (like skbs,
> nf_conn etc) won't dedup either since they'll point
> at "their" version of struct net.
> 	
> Not sure if that's the root cause here, but it seems
> like it is happening in other modules at least.

hi,
I did not have CONFIG_IP_VS enabled.. but when I enabled it I can see
exactly what you described

I have bpftool change that dumps BTF type with all its nesting types
and comparing the output for 'struct nf_conn' on vmlinux and ip_vs.ko
module results in:

	-[xxx] FWD 'netns_ipvs' fwd_kind=struct
	+[xxx] STRUCT 'netns_ipvs' size=2344 vlen=74
	+       'gen' type_id=xxx bits_offset=0
	+       'enable' type_id=xxx bits_offset=32
	+       'rs_table' type_id=xxx bits_offset=64
	+       'app_list' type_id=xxx bits_offset=1088
	+       'proto_data_table' type_id=xxx bits_offset=1216

	...

	-[xxx] STRUCT 'nf_ct_ext' size=16 vlen=4
	-       'offset' type_id=xxx bits_offset=0
	-       'len' type_id=xxx bits_offset=64
	-       'gen_id' type_id=xxx bits_offset=96
	-       'data' type_id=xxx bits_offset=128
	+[xxx] FWD 'nf_ct_ext' fwd_kind=struct

I guess the the nf_ct_ext is the other way around case


but without CONFIG_IP_VS, I don't see any other 'fwd kind' changes
by comparing 'struct nf_conn' in vmlinux and nf_conntrack.ko

in fact if I don't count ID values differences there's no diff at all,
so I wonder there's something else going on as well

attaching my config if you want to check

thanks,
jirka


---
#
# Automatically generated file; DO NOT EDIT.
# Linux/x86 6.0.0 Kernel Configuration
#
CONFIG_CC_VERSION_TEXT="gcc (GCC) 12.2.1 20220819 (Red Hat 12.2.1-2)"
CONFIG_CC_IS_GCC=y
CONFIG_GCC_VERSION=120201
CONFIG_CLANG_VERSION=0
CONFIG_AS_IS_GNU=y
CONFIG_AS_VERSION=23700
CONFIG_LD_IS_BFD=y
CONFIG_LD_VERSION=23700
CONFIG_LLD_VERSION=0
CONFIG_CC_CAN_LINK=y
CONFIG_CC_CAN_LINK_STATIC=y
CONFIG_CC_HAS_ASM_GOTO_OUTPUT=y
CONFIG_CC_HAS_ASM_GOTO_TIED_OUTPUT=y
CONFIG_CC_HAS_ASM_INLINE=y
CONFIG_CC_HAS_NO_PROFILE_FN_ATTR=y
CONFIG_PAHOLE_VERSION=123
CONFIG_CONSTRUCTORS=y
CONFIG_IRQ_WORK=y
CONFIG_BUILDTIME_TABLE_SORT=y
CONFIG_THREAD_INFO_IN_TASK=y

#
# General setup
#
CONFIG_INIT_ENV_ARG_LIMIT=32
CONFIG_COMPILE_TEST=y
CONFIG_WERROR=y
CONFIG_UAPI_HEADER_TEST=y
CONFIG_LOCALVERSION=""
CONFIG_BUILD_SALT=""
CONFIG_HAVE_KERNEL_GZIP=y
CONFIG_HAVE_KERNEL_BZIP2=y
CONFIG_HAVE_KERNEL_LZMA=y
CONFIG_HAVE_KERNEL_XZ=y
CONFIG_HAVE_KERNEL_LZO=y
CONFIG_HAVE_KERNEL_LZ4=y
CONFIG_HAVE_KERNEL_ZSTD=y
CONFIG_KERNEL_GZIP=y
# CONFIG_KERNEL_BZIP2 is not set
# CONFIG_KERNEL_LZMA is not set
# CONFIG_KERNEL_XZ is not set
# CONFIG_KERNEL_LZO is not set
# CONFIG_KERNEL_LZ4 is not set
# CONFIG_KERNEL_ZSTD is not set
CONFIG_DEFAULT_INIT=""
CONFIG_DEFAULT_HOSTNAME="(none)"
CONFIG_SYSVIPC=y
CONFIG_SYSVIPC_SYSCTL=y
CONFIG_SYSVIPC_COMPAT=y
CONFIG_POSIX_MQUEUE=y
CONFIG_POSIX_MQUEUE_SYSCTL=y
CONFIG_WATCH_QUEUE=y
CONFIG_CROSS_MEMORY_ATTACH=y
CONFIG_USELIB=y
CONFIG_AUDIT=y
CONFIG_HAVE_ARCH_AUDITSYSCALL=y
CONFIG_AUDITSYSCALL=y

#
# IRQ subsystem
#
CONFIG_GENERIC_IRQ_PROBE=y
CONFIG_GENERIC_IRQ_SHOW=y
CONFIG_GENERIC_IRQ_EFFECTIVE_AFF_MASK=y
CONFIG_GENERIC_PENDING_IRQ=y
CONFIG_GENERIC_IRQ_MIGRATION=y
CONFIG_GENERIC_IRQ_INJECTION=y
CONFIG_HARDIRQS_SW_RESEND=y
CONFIG_GENERIC_IRQ_CHIP=y
CONFIG_IRQ_DOMAIN=y
CONFIG_IRQ_DOMAIN_HIERARCHY=y
CONFIG_GENERIC_MSI_IRQ=y
CONFIG_GENERIC_MSI_IRQ_DOMAIN=y
CONFIG_IRQ_MSI_IOMMU=y
CONFIG_GENERIC_IRQ_MATRIX_ALLOCATOR=y
CONFIG_GENERIC_IRQ_RESERVATION_MODE=y
CONFIG_IRQ_FORCED_THREADING=y
CONFIG_SPARSE_IRQ=y
CONFIG_GENERIC_IRQ_DEBUGFS=y
# end of IRQ subsystem

CONFIG_CLOCKSOURCE_WATCHDOG=y
CONFIG_ARCH_CLOCKSOURCE_INIT=y
CONFIG_CLOCKSOURCE_VALIDATE_LAST_CYCLE=y
CONFIG_GENERIC_TIME_VSYSCALL=y
CONFIG_GENERIC_CLOCKEVENTS=y
CONFIG_GENERIC_CLOCKEVENTS_BROADCAST=y
CONFIG_GENERIC_CLOCKEVENTS_MIN_ADJUST=y
CONFIG_GENERIC_CMOS_UPDATE=y
CONFIG_HAVE_POSIX_CPU_TIMERS_TASK_WORK=y
CONFIG_POSIX_CPU_TIMERS_TASK_WORK=y
CONFIG_CONTEXT_TRACKING=y
CONFIG_CONTEXT_TRACKING_IDLE=y

#
# Timers subsystem
#
CONFIG_TICK_ONESHOT=y
CONFIG_NO_HZ_COMMON=y
# CONFIG_HZ_PERIODIC is not set
CONFIG_NO_HZ_IDLE=y
# CONFIG_NO_HZ_FULL is not set
CONFIG_NO_HZ=y
CONFIG_HIGH_RES_TIMERS=y
CONFIG_CLOCKSOURCE_WATCHDOG_MAX_SKEW_US=100
# end of Timers subsystem

CONFIG_BPF=y
CONFIG_HAVE_EBPF_JIT=y
CONFIG_ARCH_WANT_DEFAULT_BPF_JIT=y

#
# BPF subsystem
#
CONFIG_BPF_SYSCALL=y
CONFIG_BPF_JIT=y
CONFIG_BPF_JIT_ALWAYS_ON=y
CONFIG_BPF_JIT_DEFAULT_ON=y
CONFIG_BPF_UNPRIV_DEFAULT_OFF=y
CONFIG_USERMODE_DRIVER=y
CONFIG_BPF_LSM=y
# end of BPF subsystem

CONFIG_PREEMPT_BUILD=y
CONFIG_PREEMPT_NONE=y
# CONFIG_PREEMPT_VOLUNTARY is not set
# CONFIG_PREEMPT is not set
CONFIG_PREEMPT_COUNT=y
CONFIG_PREEMPTION=y
CONFIG_PREEMPT_DYNAMIC=y
CONFIG_SCHED_CORE=y

#
# CPU/Task time and stats accounting
#
CONFIG_TICK_CPU_ACCOUNTING=y
# CONFIG_VIRT_CPU_ACCOUNTING_GEN is not set
CONFIG_IRQ_TIME_ACCOUNTING=y
CONFIG_HAVE_SCHED_AVG_IRQ=y
CONFIG_BSD_PROCESS_ACCT=y
CONFIG_BSD_PROCESS_ACCT_V3=y
CONFIG_TASKSTATS=y
CONFIG_TASK_DELAY_ACCT=y
CONFIG_TASK_XACCT=y
CONFIG_TASK_IO_ACCOUNTING=y
CONFIG_PSI=y
CONFIG_PSI_DEFAULT_DISABLED=y
