Return-Path: <netdev-owner@vger.kernel.org>
X-Original-To: lists+netdev@lfdr.de
Delivered-To: lists+netdev@lfdr.de
Received: from vger.kernel.org (vger.kernel.org [209.132.180.67])
	by mail.lfdr.de (Postfix) with ESMTP id 114F66019A
	for <lists+netdev@lfdr.de>; Fri,  5 Jul 2019 09:42:28 +0200 (CEST)
Received: (majordomo@vger.kernel.org) by vger.kernel.org via listexpand
        id S1727651AbfGEHm0 (ORCPT <rfc822;lists+netdev@lfdr.de>);
        Fri, 5 Jul 2019 03:42:26 -0400
Received: from mga09.intel.com ([134.134.136.24]:7790 "EHLO mga09.intel.com"
        rhost-flags-OK-OK-OK-OK) by vger.kernel.org with ESMTP
        id S1725862AbfGEHmZ (ORCPT <rfc822;netdev@vger.kernel.org>);
        Fri, 5 Jul 2019 03:42:25 -0400
X-Amp-Result: UNSCANNABLE
X-Amp-File-Uploaded: False
Received: from fmsmga003.fm.intel.com ([10.253.24.29])
  by orsmga102.jf.intel.com with ESMTP/TLS/DHE-RSA-AES256-GCM-SHA384; 05 Jul 2019 00:42:14 -0700
X-ExtLoop1: 1
X-IronPort-AV: E=Sophos;i="5.63,454,1557212400"; 
   d="xz'?scan'208";a="172589965"
Received: from shao2-debian.sh.intel.com (HELO localhost) ([10.239.13.6])
  by FMSMGA003.fm.intel.com with ESMTP; 05 Jul 2019 00:42:09 -0700
Date:   Fri, 5 Jul 2019 15:42:16 +0800
From:   kernel test robot <rong.a.chen@intel.com>
To:     Andrii Nakryiko <andriin@fb.com>
Cc:     andrii.nakryiko@gmail.com, ast@fb.com, daniel@iogearbox.net,
        bpf@vger.kernel.org, netdev@vger.kernel.org, songliubraving@fb.com,
        Andrii Nakryiko <andriin@fb.com>, lkp@01.org
Subject: [selftests/bpf]  6135bdd95f:
 kernel_selftests.bpf.test_offload.py.fail
Message-ID: <20190705074215.GC17490@shao2-debian>
MIME-Version: 1.0
Content-Type: multipart/mixed; boundary="eHhjakXzOLJAF9wJ"
Content-Disposition: inline
In-Reply-To: <20190628152539.3014719-5-andriin@fb.com>
User-Agent: NeoMutt/20170113 (1.7.2)
Sender: netdev-owner@vger.kernel.org
Precedence: bulk
List-ID: <netdev.vger.kernel.org>
X-Mailing-List: netdev@vger.kernel.org


--eHhjakXzOLJAF9wJ
Content-Type: text/plain; charset=utf-8
Content-Disposition: inline

FYI, we noticed the following commit (built with gcc-7):

commit: 6135bdd95f26fe417db4e46d1e517de41e0ab9c1 ("[PATCH v2 bpf-next 4/4] selftests/bpf: convert legacy BPF maps to BTF-defined ones")
url: https://github.com/0day-ci/linux/commits/Andrii-Nakryiko/capture-integers-in-BTF-type-info-for-map-defs/20190701-041153
base: https://kernel.googlesource.com/pub/scm/linux/kernel/git/bpf/bpf-next.git master

in testcase: kernel_selftests
with following parameters:

	group: kselftests-00

test-description: The kernel contains a set of "self tests" under the tools/testing/selftests/ directory. These are intended to be small unit tests to exercise individual code paths in the kernel.
test-url: https://www.kernel.org/doc/Documentation/kselftest.txt


on test machine: qemu-system-x86_64 -enable-kvm -cpu SandyBridge -smp 2 -m 8G

caused below changes (please refer to attached dmesg/kmsg for entire log/backtrace):


If you fix the issue, kindly add following tag
Reported-by: kernel test robot <rong.a.chen@intel.com>


# selftests: bpf: test_offload.py
# Test destruction of generic XDP...
# Test TC non-offloaded...
# Test TC non-offloaded isn't getting bound...
# Test TC offloads are off by default...
# Test TC offload by default...
# Test TC cBPF bytcode tries offload by default...
# Test TC cBPF unbound bytecode doesn't offload...
# Test non-0 chain offload...
# Test TC replace...
# Test TC replace bad flags...
# Test spurious extack from the driver...
# Test TC offloads work...
# Test TC offload basics...
# Test TC offload is device-bound...
# Test disabling TC offloads is rejected while filters installed...
# Test qdisc removal frees things...
# Test disabling TC offloads is OK without filters...
# Test destroying device gets rid of TC filters...
# Test destroying device gets rid of XDP...
# Test XDP prog reporting...
# Test XDP prog replace without force...
# Test XDP prog replace with force...
# Test XDP prog replace with bad flags...
# Test XDP prog remove with bad flags...
# Test MTU restrictions...
# Test non-offload XDP attaching to HW...
# Test offload XDP attaching to drv...
# Test XDP offload...
# Test XDP offload is device bound...
# Test removing XDP program many times...
# Test attempt to use a program for a wrong device...
# Test multi-attachment XDP - default + offload...
# Test multi-attachment XDP - replace...
# Test multi-attachment XDP - detach...
# Test multi-attachment XDP - reattach...
# Test multi-attachment XDP - device remove...
# Test multi-attachment XDP - drv + offload...
# Test multi-attachment XDP - replace...
# Test multi-attachment XDP - detach...
# Test multi-attachment XDP - reattach...
# Test multi-attachment XDP - device remove...
# Test multi-attachment XDP - generic + offload...
# Test multi-attachment XDP - replace...
# Test multi-attachment XDP - reattach...
# Test multi-attachment XDP - device remove...
# Test mixing of TC and XDP...
# Test binding TC from pinned...
# Test binding XDP from pinned...
# Test offload of wrong type fails...
# Test asking for TC offload of two filters...
# Test if netdev removal waits for translation...
# Test loading program with maps...
# Traceback (most recent call last):
#   File "./test_offload.py", line 1153, in <module>
#     sim.set_xdp(map_obj, "offload", JSON=False) # map fixup msg breaks JSON
#   File "./test_offload.py", line 469, in set_xdp
#     fail=fail, include_stderr=include_stderr)
#   File "./test_offload.py", line 230, in ip
#     fail=fail, include_stderr=include_stderr)
#   File "./test_offload.py", line 155, in tool
#     fail=fail, include_stderr=False)
#   File "./test_offload.py", line 108, in cmd
#     return cmd_result(proc, include_stderr=include_stderr, fail=fail)
#   File "./test_offload.py", line 130, in cmd_result
#     raise Exception("Command failed: %s\n%s" % (proc.args, stderr))
# Exception: Command failed: ip link set dev eth1 xdpoffload obj /usr/src/perf_selftests-x86_64-rhel-7.6-6135bdd95f26fe417db4e46d1e517de41e0ab9c1/tools/testing/selftests/bpf/sample_map_ret0.o sec .text
# 
# 
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       811
# Verifier analysis:
# 
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 384
# str_off: 384
# str_len: 403
# btf_total_size: 811
# [1] FUNC_PROTO (anon) return=2 args=(void)
# [2] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
# [3] FUNC func type_id=1
# [4] STRUCT (anon) size=32 vlen=4
# 	type type_id=5 bits_offset=0
# 	max_entries type_id=8 bits_offset=64
# 	key type_id=10 bits_offset=128
# 	value type_id=13 bits_offset=192
# [5] PTR (anon) type_id=6
# [6] ARRAY (anon) type_id=2 index_type_id=7 nr_elems=1
# [7] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [8] PTR (anon) type_id=9
# [9] ARRAY (anon) type_id=2 index_type_id=7 nr_elems=2
# [10] PTR (anon) type_id=11
# [11] TYPEDEF __u32 type_id=12
# [12] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
# [13] PTR (anon) type_id=14
# [14] INT long int size=8 bits_offset=0 nr_bits=64 encoding=SIGNED
# [15] VAR htab type_id=4 linkage=1
# [16] STRUCT (anon) size=32 vlen=4
# 	type type_id=8 bits_offset=0
# 	max_entries type_id=8 bits_offset=64
# 	key type_id=10 bits_offset=128
# 	value type_id=13 bits_offset=192
# [17] VAR array type_id=16 linkage=1
# [18] DATASEC .maps size=0 vlen=2 size == 0
# 
# 
# Prog section '.text' rejected: Permission denied (13)!
#  - Type:         6
#  - Instructions: 21 (0 over limit)
#  - License:      
# 
# Verifier analysis:
# 
# 0: (b7) r1 = 0
# 1: (7b) *(u64 *)(r10 -8) = r1
# last_idx 1 first_idx 0
# regs=2 stack=0 before 0: (b7) r1 = 0
# 2: (63) *(u32 *)(r10 -12) = r1
# 3: (bf) r2 = r10
# 4: (07) r2 += -12
# 5: (18) r1 = 0x0
# 7: (85) call bpf_map_lookup_elem#1
# R1 type=inv expected=map_ptr
# processed 7 insns (limit 1000000) max_states_per_insn 0 total_states 0 peak_states 0 mark_read 0
# 
# Error fetching program/map!
not ok 34 selftests: bpf: test_offload.py


To reproduce:

        # build kernel
	cd linux
	cp config-5.2.0-rc5-01621-g6135bdd95f26f .config
	make HOSTCC=gcc-7 CC=gcc-7 ARCH=x86_64 olddefconfig prepare modules_prepare bzImage

        git clone https://github.com/intel/lkp-tests.git
        cd lkp-tests
        bin/lkp qemu -k <bzImage> job-script # job-script is attached in this email



Thanks,
Rong Chen


--eHhjakXzOLJAF9wJ
Content-Type: text/plain; charset=us-ascii
Content-Disposition: attachment; filename="config-5.2.0-rc5-01621-g6135bdd95f26f"

#
# Automatically generated file; DO NOT EDIT.
# Linux/x86_64 5.2.0-rc5 Kernel Configuration
#

#
# Compiler: gcc-7 (Debian 7.4.0-6) 7.4.0
#
CONFIG_CC_IS_GCC=y
CONFIG_GCC_VERSION=70400
CONFIG_CLANG_VERSION=0
CONFIG_CC_HAS_ASM_GOTO=y
CONFIG_CC_HAS_WARN_MAYBE_UNINITIALIZED=y
CONFIG_IRQ_WORK=y
CONFIG_BUILDTIME_EXTABLE_SORT=y
CONFIG_THREAD_INFO_IN_TASK=y

#
# General setup
#
CONFIG_INIT_ENV_ARG_LIMIT=32
# CONFIG_COMPILE_TEST is not set
CONFIG_LOCALVERSION=""
CONFIG_LOCALVERSION_AUTO=y
CONFIG_BUILD_SALT=""
CONFIG_HAVE_KERNEL_GZIP=y
CONFIG_HAVE_KERNEL_BZIP2=y
CONFIG_HAVE_KERNEL_LZMA=y
CONFIG_HAVE_KERNEL_XZ=y
CONFIG_HAVE_KERNEL_LZO=y
CONFIG_HAVE_KERNEL_LZ4=y
CONFIG_KERNEL_GZIP=y
# CONFIG_KERNEL_BZIP2 is not set
# CONFIG_KERNEL_LZMA is not set
# CONFIG_KERNEL_XZ is not set
# CONFIG_KERNEL_LZO is not set
# CONFIG_KERNEL_LZ4 is not set
CONFIG_DEFAULT_HOSTNAME="(none)"
CONFIG_SWAP=y
CONFIG_SYSVIPC=y
CONFIG_SYSVIPC_SYSCTL=y
CONFIG_POSIX_MQUEUE=y
CONFIG_POSIX_MQUEUE_SYSCTL=y
CONFIG_CROSS_MEMORY_ATTACH=y
CONFIG_USELIB=y
CONFIG_AUDIT=y
CONFIG_HAVE_ARCH_AUDITSYSCALL=y
CONFIG_AUDITSYSCALL=y

#
# IRQ subsystem
#
CONFIG_GENERIC_IRQ_PROBE=y
CONFIG_GENERIC_IRQ_SHOW=y
CONFIG_GENERIC_IRQ_EFFECTIVE_AFF_MASK=y
CONFIG_GENERIC_PENDING_IRQ=y
CONFIG_GENERIC_IRQ_MIGRATION=y
CONFIG_IRQ_DOMAIN=y
CONFIG_IRQ_SIM=y
CONFIG_IRQ_DOMAIN_HIERARCHY=y
CONFIG_GENERIC_MSI_IRQ=y
CONFIG_GENERIC_MSI_IRQ_DOMAIN=y
CONFIG_GENERIC_IRQ_MATRIX_ALLOCATOR=y
CONFIG_GENERIC_IRQ_RESERVATION_MODE=y
CONFIG_IRQ_FORCED_THREADING=y
CONFIG_SPARSE_IRQ=y
# CONFIG_GENERIC_IRQ_DEBUGFS is not set
# end of IRQ subsystem

CONFIG_CLOCKSOURCE_WATCHDOG=y
CONFIG_ARCH_CLOCKSOURCE_DATA=y
CONFIG_ARCH_CLOCKSOURCE_INIT=y
CONFIG_CLOCKSOURCE_VALIDATE_LAST_CYCLE=y
CONFIG_GENERIC_TIME_VSYSCALL=y
CONFIG_GENERIC_CLOCKEVENTS=y
CONFIG_GENERIC_CLOCKEVENTS_BROADCAST=y
CONFIG_GENERIC_CLOCKEVENTS_MIN_ADJUST=y
CONFIG_GENERIC_CMOS_UPDATE=y

#
# Timers subsystem
#
CONFIG_TICK_ONESHOT=y
CONFIG_NO_HZ_COMMON=y
# CONFIG_HZ_PERIODIC is not set
# CONFIG_NO_HZ_IDLE is not set
CONFIG_NO_HZ_FULL=y
CONFIG_CONTEXT_TRACKING=y
# CONFIG_CONTEXT_TRACKING_FORCE is not set
CONFIG_NO_HZ=y
CONFIG_HIGH_RES_TIMERS=y
# end of Timers subsystem

# CONFIG_PREEMPT_NONE is not set
CONFIG_PREEMPT_VOLUNTARY=y
# CONFIG_PREEMPT is not set
CONFIG_PREEMPT_COUNT=y

#
# CPU/Task time and stats accounting
#
CONFIG_VIRT_CPU_ACCOUNTING=y
CONFIG_VIRT_CPU_ACCOUNTING_GEN=y
# CONFIG_IRQ_TIME_ACCOUNTING is not set
CONFIG_HAVE_SCHED_AVG_IRQ=y
CONFIG_BSD_PROCESS_ACCT=y
CONFIG_BSD_PROCESS_ACCT_V3=y
CONFIG_TASKSTATS=y
CONFIG_TASK_DELAY_ACCT=y
CONFIG_TASK_XACCT=y
CONFIG_TASK_IO_ACCOUNTING=y
# CONFIG_PSI is not set
# end of CPU/Task time and stats accounting

CONFIG_CPU_ISOLATION=y

#
# RCU Subsystem
#
CONFIG_TREE_RCU=y
# CONFIG_RCU_EXPERT is not set
